Tekla Open API Reference for Tekla Structures 2025
RebarMesh.RebarMeshCrossBarLocationEnum Enumeration
 The ways to locate the crossing bars.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum RebarMeshCrossBarLocationEnum
Public Enumeration RebarMeshCrossBarLocationEnum
Members
Member name | Value | Description
LOCATION_TYPE_UNDEFINED | -1 |  The undefined location type.
LOCATION_TYPE_ABOVE | 0 |  The location of the crossing bars is above the longitudinal bars.
LOCATION_TYPE_BELOW | 1 |  The location of the crossing bars is below the longitudinal bars.
See Also
Reference
Tekla.Structures.Model Namespace